app/controllers/apartments_controller.rb

  def index
    @apartments = Apartment.all
---
SELECT "apartments".* FROM "apartments"

  def create
    @apartment = current_user.apartments.new(apartment_params)

    respond_to do |format|
      if @apartment.save
---
INSERT INTO "apartments" ("address", "city", "state", "country", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)